package com.example.myapplication;

import androidx.appcompat.app.AppCompatActivity;
import androidx.cardview.widget.CardView;

import android.content.Context;
import android.content.Intent;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ListView;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.HashMap;

public class MainActivity2 extends AppCompatActivity {


    ListView listView;

  ArrayList<HashMap<String,String>>arrayList=new ArrayList<>();

  HashMap<String,String>hashMap;



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);

        listView=findViewById(R.id.listview);



        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");

        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);




        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("name","সহীহ বুখারী");
        hashMap.put("tittle","অধ্যায় নং ১ থেকে ২");
        hashMap.put("dis","পরবর্তীতে ওয়াসওয়াসা বা কুমন্ত্রণার পর্যায়ে নিয়ে যাবে। কাজটি করার শুরুতে নিয়ত ঠিক করার পর বারবার বলার প্রয়োজন নেই।\n" +
                "৩. নিয়তের স্থান হচ্ছে অন্তর। যদি মুখে উচ্চারণ করা হয় তবে সেটা বিদআত হবে।\n" +
                "৪. লোক দেখানো কিংবা শোনানোর প্রবণতা থেকে সাবধান থাকতে হবে। কারণ তা ইবাদাত নষ্ট করে দেয়। \n" +
                "৫. অন্তরের আমল বা অন্তরের কাজের ব্যাপারে যথাযথ গুরুত্ব দিতে হবে। কারণ, তার মাধ্যমেই ইবাদতের শুদ্ধাশুদ্ধি অনেকাংশে নির্ভর করছে।\n" +
                "৬. দ্বীন ও ইসলামের হেফাযতের জন্য অমুসলিম দেশ থেকে মুসলিম দেশে হিজরত করা অত্যন্ত সাওয়াবের কাজ, উত্তম ও উৎকৃষ্ট ইবাদত। তবে শর্ত হচ্ছে, একমাত্র আল্লাহর সন্তুষ্টির জন্য তা সংঘটিত হওয়া।\n" +
                "৭. ইবাদত যখন এমন জিনিস হবে যাতে একটি নিয়তই কার্যকর করা যায়, যেমন- সাওম পালন করা, সালাত আদায় করা। এমতাবস্থায় সে কাজের শুরুতে যা নিয়ত করবে তা ই হবে। কিন্তু যে ইবাদতের অংশ ভিন্ন ভিন্ন থাকে, তখন সেটার যে অংশের নিয়ত যা হবে সে অংশের হুকুম তা নির্ধারিত হবে। যেমন-" +
                " যাকাত প্রদান করা। যখন লোক দেখানোর নিয়ত থাকবে তখন তা রিয়া ও আমল ধ্বংস করবে, আবার যখন সাওয়াবের আশা করবে তখন তা বিশুদ্ধ হবে।\n");
        arrayList.add(hashMap);











































        MYadaptar mYadaptar=new MYadaptar();

        listView.setAdapter(mYadaptar);




    }

   /// on  view

   public class MYadaptar extends BaseAdapter{


       @Override
       public int getCount() {
           return arrayList.size();
       }

       @Override
       public Object getItem(int position) {
           return null;
       }

       @Override
       public long getItemId(int position) {
           return 0;
       }

       @Override
       public View getView(int position, View convertView, ViewGroup parent) {

           LayoutInflater layoutInflater= (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
       View Myview= layoutInflater.inflate(R.layout.layout,parent,false);


           TextView tittle1,tittle2;


           tittle1=Myview.findViewById(R.id.tittle1);
           tittle2=Myview.findViewById(R.id.tittle2);

           // id card view
           CardView cardView=Myview.findViewById(R.id.cardView);


             HashMap<String,String>hashMap=arrayList.get(position);
         String name=    hashMap.get("name");

           String tittle=  hashMap.get("tittle");
           String dis=hashMap.get("dis");

           //  3 activity



           cardView.setOnClickListener(new View.OnClickListener() {
               @Override
               public void onClick(View v) {


                   MainActivity3.Disc=dis;

                   startActivity(new Intent(MainActivity2.this,MainActivity3.class));



               }
           });

           //// close








           tittle1.setText(name);
           tittle2.setText(tittle);





















           return Myview;
       }
   }










}